-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1:3306
-- Generation Time: 2018-06-14 16:41:39
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


--
-- Database: `login`
--
CREATE DATABASE IF NOT EXISTS `login` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `login`;

-- --------------------------------------------------------

--
-- 表的结构 `booktable`
--

DROP TABLE IF EXISTS `booktable`;
CREATE TABLE IF NOT EXISTS `booktable` (
  `book_id` int(10) NOT NULL COMMENT '图书编号',
  `title` varchar(100) NOT NULL COMMENT '书名',
  `author` varchar(50) NOT NULL COMMENT '作者',
  `cover_addr` varchar(200) NOT NULL COMMENT '封面地址',
  `type` varchar(200) NOT NULL,
  `grade` int(1) NOT NULL DEFAULT '0' COMMENT '星级',
  `intro` varchar(500) DEFAULT NULL COMMENT '图书简介'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='图书数据表';

--
-- 插入之前先把表清空（truncate） `booktable`
--

TRUNCATE TABLE `booktable`;
--
-- 转存表中的数据 `booktable`
--

insert into booktable values('16','人性的弱点','戴尔·卡耐基','https://img3.doubanio.com/view/ark_article_cover/retina/public/6416401.jpg?v=1414381060.0','motivational','9.2','《人性的弱点》作为卡耐基最成功的励志经典，荟萃了卡耐基思想理论最精华的部分。该书在1937年首次出版，刚一上市就风靡全球，几十年间被翻译成全世界几乎所有的主要语言，全球总销量已达1.5亿余册，被视为社交心理和沟通技巧的“圣经”。它改变了千千万万人的命运。发明之王爱迪生、相对论鼻祖爱因斯坦、印度圣雄甘地、“米老鼠”的父亲华特·迪士尼、建筑业奇迹的创造者里维父子、旅馆业巨子希尔顿、白手起家的台湾塑料大王王永庆、麦当劳的创始人雷?克洛克等等，都深受卡内基思想和观点的激励和影响。《人性的弱点》作为一本实用的人际关系著作，从人性本质的角度，挖掘出潜藏在人们体内的弱点，使人们能够充分认识自己，并不断改造自己，从而能有所长进，直至取得最后的成功。在过去的77年里，戴尔·卡耐基的忠告带领着上千万名读者攀登上成功的阶梯，无论在事业方面还是个人生活上，他的箴言不断被一代代人实践与验证。在出版史上，本书创造了全世界图书销售空前的记录。在经济萧条时期之后，本书满足了普遍存在的人性的需要，触动了读者的神经，在当今社会依然有其特有的借鉴价值。');
insert into booktable values('17','少有人走的路','斯科特·派克','https://img3.doubanio.com/view/subject/l/public/s2144391.jpg','motivational','8.4','这本书处处透露出沟通与理解的意味，它跨越时代限制，帮助我们探索爱的本质，引导我们过上崭新，宁静而丰富的生活；它帮助我们学习爱，也学习独立；它教诲我们成为更称职的、更有理解心的父母。归根到底，它告诉我们怎样找到真正的自我。正如开篇所言：人生苦难重重。M·斯科特·派克让我们更加清楚：人生是一场艰辛之旅，心智成熟的旅程相当漫长。但是，他没有让我们感到恐惧，相反，他带领我们去经历一系列艰难乃至痛苦的转变，最终达到自我认知的更高境界。');
insert into booktable values('18','强风吹拂','三浦紫苑','https://img1.doubanio.com/view/subject/l/public/s27914268.jpg','motivational','9.0','长跑的目标不是更快，而是更强。“明明这么痛苦，这么难过，为什么就是不能放弃跑步？因为全身细胞都在蠢蠢欲动，想要感受强风迎面吹拂的滋味。”宽政大学宿舍“竹青庄”的十名舍友凑成杂牌长跑队，在队长清濑灰二的魔鬼训练下，从零开始向日本历史最悠久的长跑接力赛“箱根驿传”挺进 。这十名大学生包括两名田径队逃兵、一对神经大条又聒噪的双胞胎、俊帅漫画宅男、尼古丁中毒的万年留级生、逻辑超强的毒舌精英、不爱跑步的黑人留学生、老实好青年、百发百中猜谜王。这些“选手”刚开始时连自己是田径队都不知道，且一半成员没有长跑经验。他们能否创造“箱根驿传”史上最大奇迹？不到最后一棒，没人知道答案。');
insert into booktable values('19','把时间当作朋友','李笑来','https://img3.doubanio.com/view/subject/l/public/s3778613.jpg','motivational','8.5','这本书从心智成长的角度来谈时间管理，指出时间管理是成功的关键所在。作者引述自己从事的职业中所遇到的事例，告诉我们：如何打开心智，如何运用心智来和时间做朋友，如何理解时间管理的意义，在时间管理上取得突破，进而用心智开启自己的人生成功之旅。');
insert into booktable values('20','滚蛋吧!肿瘤君','熊顿','https://img3.doubanio.com/view/subject/l/public/s20742806.jpg','motivational','9.2','《滚蛋吧!肿瘤君:我与癌症斗争的一年里》由熊顿本人创作，以她治疗的过程和内心感触为素材，讲述了一个癌症患者笑对生活的感人纪实。在睁眼就是治疗室，入耳就是化疗、吃药、体温、白细胞增减的环境里，她乐观的记录了自己的每一段经历，用画笔细心捕捉了来自父母、亲人、朋友的关怀和生活中的点滴感动。一个风趣幽默的漫画家，在经历疾病给她带来的天翻地覆的变化后，仍旧用作品里难以置信的坚强和幽默风趣的自嘲泰然处之。也能从中获得积极面对人生挫折的正能量。相信《滚蛋吧!肿瘤君:我与癌症斗争的一年里》，能帮助千千万万的读者，留下彼此人生中最珍贵的东西——信念。阅读此书，读者能感受到这本漫画簿子，已经与她略显脆弱的生命，融为一体。');
insert into booktable values('21','奇特的一生','格拉宁','https://img3.doubanio.com/view/subject/l/public/s1093496.jpg','motivational','8.3','人最宝贵的是生命。但是仔细分析一下这个生命，可以说，最宝贵的是时间。因为生命是由时间构成的，是一小时一小时、一分钟一分钟累积起来的。没人能预计他在下一分钟里能发生什么，但至少我们可以记得前一分钟我们做过什么。这里是要讲述一个将自己的一生用时间来计划的人——柳比歇夫。柳比歇夫通过他的时间统计法对自己进行了研究和试验：试验在写、读、听、工作、思索各方面，他到底能干多少？干多少？怎么干？他不让自己负担过重，力不胜任；他总是循着他能力的边缘前进，他对自己能力的掂量精确无疑。如果每个人都能知道自己能干些什么，那生活会变得多么美好！因为每个人的能力都比他自己感觉到的大得多，也就不会有那么多的人感叹自己因能力有限而导致一事无成。');
insert into booktable values('22','考拉小巫的英语学习日记','考拉小巫','https://img3.doubanio.com/view/subject/l/public/s7653652.jpg','motivational','8.1','《考拉小巫的英语学习日记:写给为梦想而奋斗的人》的出版是献给考拉小巫粉丝以及所有英语学习爱好者的一份礼物。在《考拉小巫的英语学习日记:写给为梦想而奋斗的人》里，考拉小巫分享了她人生中各个阶段学习英语的所有方法途径及心得体会，和她为了从根本上提高英语听、说、读、写、译能力所做的一切失败和成功的尝试及努力，以及她考过的所有英语考试的备考方案、计划安排、所用书籍及资料，书后附录中还有作者总结的英语学习资料及资源推荐。除了分享英语学习方法外，考拉小巫还分享了她与伊甸园字幕组的亲密接触、她被全美专业排名第一的美国名校录取的成功申请经验、她在美国的求学生活以及在美语环境中关于英语学习的新思考和新感悟……这不仅仅是一部英语学习日记，更是一本她在彷徨、动摇和无助时的人生感悟，是关于坚持、奋斗和梦想的碎碎念，是关于她一路走来对所有的所学所得和所思所想的沉淀。从《考拉小巫的英语学习日记:写给为梦想而奋斗的人》的叙述不难看出她对梦想和奋斗的崇尚，相信这本励志书一定能激发你去为理想奋斗和拼搏。英语怎么学，考拉小巫告诉你：单词就得这么背；听力是这样练成的；关于“看电影，学英语”；圆满的托福，圆满的2007；十天挑战GRE单词；GRE作文5.5之浓缩心得：“写”就一个字。');
insert into booktable values('23','美的历程','李泽厚','https://img3.doubanio.com/view/subject/l/public/s3893343.jpg','art','9.2','本书是中国美学的经典之作。凝聚了作者李泽厚先生多年研究，他把中国人古往今来对美的感觉玲珑剔透地展现在大家眼前，如斯感性，如斯亲切。今配以精美的插图，本书就更具体地显现出中国这段波澜壮阔的美的历程。《美的历程》是部大书（应该说是几部大书），是一部中国美学和美术史，一部中国文学史，一部中国哲学史，一部中国文化史。');
insert into booktable values('24','聆听音乐','克雷格·莱特','https://img1.doubanio.com/view/subject/l/public/s9053208.jpg','art','9.5','这是一部不可多得的音乐欣赏指南，帮助读者理解任何时代及文化中的音乐，发展和提炼聆听技巧。阅读后你将会发现自己前所未有的、快乐、自信的聆听和感受音乐。');
insert into booktable values('25','花朵的秘密生命','沙曼·阿普特·萝赛','https://img1.doubanio.com/view/subject/l/public/s29448068.jpg','art','8.1','这是一本以花朵为主题的自然科普读物。作者综合植物学和科学史，以生动优美的诗意文字，描绘了花朵不为人知的生存与演化，并深入探讨了它与人类生活的密切关联。其清晰的逻辑和灵动的文笔，能够带领读者重新认识我们熟悉而又陌生的植 物，开启花朵的探秘之旅。');
insert into booktable values('26','梵高传','欧文·斯通','https://img3.doubanio.com/view/subject/l/public/s2279966.jpg','art','8.9','荷兰画家温森特·梵高是19世纪人类最杰出的艺术家之一。他热爱生活，但在生活中屡遭挫折，艰辛备尝。他献身艺术，大胆创新，在广泛学习前辈画家伦勃朗等人的基础上，吸收印象派画家在色彩方面的经验，并受到东方艺术，特别是日本版画的影响，形成了自己独特的艺术风格，创作出许多洋溢着生活激情、富于人道主义精神的作品，表现了他心中的苦闷、哀伤、同情和希望，至今饮誉世界。');
insert into booktable values('27','写给大家看的设计书（第3版）','Robin Williams','https://img3.doubanio.com/view/subject/l/public/s23486434.jpg','art','8.6','这本书出自一位世界级设计师之手。复杂的设计原理在书中凝炼为亲密性、对齐、重复和对比4 个基本原则。作者以其简洁明快的风格，将优秀设计所必须遵循的这4 个基本原则及其背后的原理通俗易懂地展现在读者面前。本书包含大量的示例，让你了解怎样才能按照自己的方式设计出美观且内容丰富的产品。');
insert into booktable values('28','退步集','陈丹青','https://img3.doubanio.com/view/subject/l/public/s1311084.jpg','art','8.1','《退步集》是陈丹青归国五年来部分文字的结集，三十余篇文章，话题兼及绘画、影像、城市、教育诸方面，自云“退步”，语涉双关，也可理解为对百年中国人文艺术领域种种“进步观”的省思和追问。');
insert into booktable values('29','荒野之歌','罗莎蒙德·基德曼·考克斯','https://img1.doubanio.com/view/subject/l/public/s29640558.jpg','art','9.5','本书呈现的是野生生物摄影中的顶尖之作，它们来自十位自然摄影大师。每位摄影师都曾赢得国际野生生物摄影年赛（Wildlife Photographer of the Year）的冠军。迄今为止，这项比赛已经举办了52届，目的是“为了鼓励野生生物摄影师们的工作，加强野生生物摄 影的声望”以及“希望通过让大众的人群关心动物，关心自然保护这个重要的话题，最终使这些奖项能够惠及动物本身”。本书每一章都展示一位自然摄影大师的十张代表作，配有文字讲述他的拍摄手法、灵感来源和拍摄目的。摄影师撰写的图片说明阐释这些照片对摄影师的重要意义，揭露作品背后的故事。');
insert into booktable values('30','美学散步','宗白华','https://img3.doubanio.com/view/subject/l/public/s4404111.jpg','art','8.8','宗先生一生著述不多，而《美学散步》则几乎汇集了其一生最精要的美学篇章，也是先生生前唯一的一部美不著作。初版于1981年，此次重版，除新增若干照片、校正部分错字外，基本保持原貌。对于这样一位源生于传统文化、洋溢着艺术灵性和诗情、深得中国美学精魂的大师以及他散步时低低的脚步声，在日益强大的现代化的机器轰鸣声中，也许再也难以再现了。然而，如何在愈益紧张的异化世界里，保持住人间的诗意和生命的憧憬，不正是现代人所要关注的一个世界性问题吗？而《美学散步》正好能给我们以这方面的启迪。');
-- -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

--
-- 表的结构 `usercollecttable`
--

DROP TABLE IF EXISTS `usercollecttable`;
CREATE TABLE IF NOT EXISTS `usercollecttable` (
  `user_id` int(10) NOT NULL COMMENT '用户编号',
  `book_id` int(10) NOT NULL COMMENT '图书编号'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户收藏数据表';

--
-- 插入之前先把表清空（truncate） `usercollecttable`
--

TRUNCATE TABLE `usercollecttable`;
-- --------------------------------------------------------

--
-- 表的结构 `user`
--
-- 创建时间： 2018-06-14 14:40:31
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `user_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '编号',
  `user_name` varchar(24) CHARACTER SET utf8mb4 NOT NULL COMMENT '用户名',
  `pwd` varchar(24) NOT NULL COMMENT '密码',
  `favourite_type` varchar(50) DEFAULT NULL COMMENT '书籍喜好',
  `image_addr` varchar(200) NOT NULL DEFAULT 'http://47.100.172.51/shared/images/user.gif' COMMENT '用户头像存储地址',
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `user_name` (`user_name`),
  UNIQUE KEY `user_id` (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 插入之前先把表清空（truncate） `user`
--

TRUNCATE TABLE `user`;
--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`user_id`, `user_name`, `pwd`, `favourite_type`, `image_addr`) VALUES
(1, 'admin', '123456', NULL, 'http://47.100.172.51/shared/images/user.gif');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
